import React from "react";
// mui 
import { Box, Card, ImageList, ImageListItem, Typography } from "@mui/material";
// img
import articleImg from '../../../../img/articleImg.svg';
// components
import ArticleCard from "../../../../components/DentistProfile/ArticleCard";
import NavGrid from "../../../../components/DentistProfile/NavGrid";


const itemData = [
    {
        id: 1,
        image: articleImg,
        title: 'توربین T2 Line-Sirona',
        desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
        isFav: true
    },
    {
        id: 1,
        image: articleImg,
        title: 'توربین T2 Line-Sirona',
        desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
        isFav: true
    },
    {
        id: 1,
        image: articleImg,
        title: 'توربین T2 Line-Sirona',
        desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
        isFav: true
    },
    {
        id: 1,
        image: articleImg,
        title: 'توربین T2 Line-Sirona',
        desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
        isFav: true
    },
    {
        id: 1,
        image: articleImg,
        title: 'توربین T2 Line-Sirona',
        desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی',
        isFav: true
    },
]
export default function FavouriteArticles() {
    return (
        <>
            <NavGrid />
            <Box sx={{
                width: '1254px',
                height: '1323px',
                marginRight: '24px',
            }}>
                <Card sx={{ p: '48px' }}>
                    <Typography variant={'h4'} sx={{ fontSize: '24px' }}>
                        <span style={{ fontWeight: 'bold' }}>علاقه مندی های من</span> | مقالات
                    </Typography>
                    <ImageList cols={1} sx={{ borderTop: 1, borderColor: '#E5E5E5' }}>
                        {itemData.map((item) => (
                            <ImageListItem key={item.id} sx={{ marginTop: '32px' }}>
                                <ArticleCard
                                    image={item.image}
                                    title={item.title}
                                    desc={item.desc}
                                    isFav={item.isFav}
                                />
                            </ImageListItem>
                        ))}
                    </ImageList>
                </Card>
            </Box>
        </>
    );
}